Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Leading and trailing
zh_cn: 首位的与末尾的

source: Learn how to increase your coding productivity.
zh_cn: 学习如何提高你的编码效率。

source: Learn more...
zh_cn: 了解更多...

source: Leave
zh_cn: 离开

source: Leave &blank
zh_cn: 留空(&B)

source: Leave blank if macro is temporary.
zh_cn: 如果宏是临时的，则留空。

source: Leave enabled
zh_cn: 继续启用

source: Left part of the assignment is not lvalue
zh_cn: 赋值的左边部分不是一个值

source: Left with Selection
zh_cn: 向左选中

source: Left-to-Right
zh_cn: 左到右

source: Left: {0}
zh_cn: 左:{0}

source: Level up
zh_cn: 升级

source: Libraries
zh_cn: 库

source: Libraries also include source files and JavaDocs that can help you develop your projects.<br><br>IntelliJ IDEA uses libraries to assist you with code completion, validation, error highlighting, etc.<br><br>Global libraries are referenced through the entire project and can be used from all modules.
zh_cn: 库还包括可以帮助您开发项目的源文件和 JavaDoc。<br><br> IntelliJ IDEA 使用库来帮助您完成代码，验证，错误高亮等。<br><br>全局库可以在整个项目引用，并可以在所有模块中使用。

source: Libraries also include source files and JavaDocs that can help you develop your projects.<br><br>IntelliJ IDEA uses libraries to assist you with code completion, validation, error highlighting, etc.<br><br>Module libraries are referenced only from the module they are attached to.
zh_cn: 库还包括可以帮助您开发项目的源文件和 JavaDoc。<br><br> IntelliJ IDEA 使用库来帮助您完成代码，验证，错误高亮等。<br><br>模块库仅从他们附加的模块引用。

source: Libraries also include source files and JavaDocs that can help you develop your projects.<br><br>IntelliJ IDEA uses libraries to assist you with code completion, validation, error highlighting, etc.<br><br>Project libraries are referenced through the entire project and can be used from all modules.
zh_cn: 库还包括可以帮助您开发项目的源文件和 JavaDoc。<br><br> IntelliJ IDEA 使用库来帮助您完成代码，验证，错误高亮等。<br><br>项目库可以在整个项目引用，并可以在所有模块中使用。

source: Libraries contain classes that add up various functionality to your applications.
zh_cn: 库包含可以将各种功能添加到应用程序的类。

source: Library
zh_cn: 库

source: Library "{0}" already exists
zh_cn: 库 "{0}" 已经存在

source: Library ''{0}'' already added to this module
zh_cn: 库 ''{0}'' 已经添加到此模块中

source: Library ''{0}'' and {1} more {1, choice, 1#library|2#libraries} are used in the project.
zh_cn: 库 ''{0}'' 和 {1} 个库在项目中使用。

source: Library ''{0}'' has broken {1, choice, 1#path|2#paths}.
zh_cn: 库有 ''{0}'' 有损坏的路径。

source: Library ''{0}'' will be added to the selected modules.
zh_cn: 库 ''{0}'' 将被添加到所选模块。

source: Library Already Added
zh_cn: 库已经添加

source: Library Already Exists
zh_cn: 库已经存在

source: Library Classes
zh_cn: 库类

source: Library Downloading Settings
zh_cn: 库下载设置

source: Library Files
zh_cn: 库文件

source: Library Name Not Specified
zh_cn: 库名称未指定

source: Library Not Configured
zh_cn: 库未配置

source: Library file ''{0}'' does not exist
zh_cn: 库文件 ''{0}'' 不存在

source: Library source does not match the bytecode for class {0}
zh_cn: 库源与类 {0} 的字节码不符

source: Library...
zh_cn: 库...

source: License Agreement
zh_cn: 许可证协议

source: License Agreement for {0}
zh_cn: {0} 的许可证协议

source: License Collision Detected
zh_cn: 检测到许可证冲突

source: License Corrupt
zh_cn: 许可证无效

source: License Expired
zh_cn: 许可证已过期

source: License Server Connection Error
zh_cn: 许可服务器连接错误

source: License Server response has not passed data integrity check: {0}
zh_cn: 许可证服务器响应未通过数据完整性检查: {0}

source: License Upgrade Needed
zh_cn: 需要升级许可证

source: License is corrupt
zh_cn: 许可证无效

source: License key:
zh_cn: 许可证密钥:

source: Limits
zh_cn: 限制

source: Line #1
zh_cn: 行 #1

source: Line #2
zh_cn: 行 #2

source: Line Coverage//Full
zh_cn: 行覆盖//完全

source: Line Coverage//Partial
zh_cn: 行覆盖//部分

source: Line Coverage//Uncovered
zh_cn: 行覆盖//未覆盖

source: Line breaks
zh_cn: 换行符

source: Line comment
zh_cn: 行注释

source: Line comment at first column
zh_cn: 行注释在第一列

source: Line comment:
zh_cn: 行注释:

source: Line is longer than allowed by code style
zh_cn: 线超过代码样式允许的长度

source: Line number
zh_cn: 行号

source: Line number is invalid
zh_cn: 行号无效

source: Line numbers info is not available in class {0}
zh_cn: 行号信息在类 {0} 中不可用

source: Line separator (for new files):
zh_cn: 行分隔符(新文件):

source: Line separator:
zh_cn: 换行符:

source: Line spacing:
zh_cn: 行间距:

source: Line {0,number,#} in {1}
zh_cn: {1} 中的 {0,number,#} 行

source: Line {0}
zh_cn: 行 {0}

source: Link
zh_cn: 链接

source: List
zh_cn: 列表

source: List View
zh_cn: 列表视图

source: List of plugins was not loaded for following hosts: {0}
zh_cn: 以下主机未加载插件列表：{0}

source: List of recently opened projects
zh_cn: 最近打开项目的列表

source: Listen
zh_cn: 监听

source: Listening to the connection, address: ''{0}'', transport: ''{1}''
zh_cn: 监听连接，地址：''{0}''，传输:''{1}''

source: Literal, PUBLIC or SYSTEM expected
zh_cn: 期望文字, PUBLIC 或 SYSTEM

source: Live Templates
zh_cn: 代码模板

source: Live Templates allow you to generate many typical code constructs in seconds!
zh_cn: 代码模板允许你快速生成许多典型的代码结构。

source: Live Templates allow you to generate many typical code constructs in seconds.
zh_cn: 代码模板允许你快速生成许多典型的代码结构。

source: Live Templates let you generate many typical code constructs in seconds.
zh_cn: 代码模板允许你快速生成许多典型的代码结构。

source: Live templates
zh_cn: 代码模板

source: Load All Required Modules
zh_cn: 加载所有必需的模块

source: Load File
zh_cn: 加载文件

source: Load Modules From JBuilder Project
zh_cn: 从 JBuilder 项目加载模块

source: Load Required Modules
zh_cn: 加载所需模块

source: Load Selected Modules Only
zh_cn: 只加载所选模块

source: Load Version
zh_cn: 加载版本

source: Load offline inspection results
zh_cn: 加载离线检查结果

source: Load/Unload Modules
zh_cn: 加载/卸载模块

source: Loaded classes are up to date.
zh_cn: 加载的类是最新的。

source: Loaded modules
zh_cn: 加载的模块

source: Loading Annotations
zh_cn: 加载注释

source: Loading Ant Configuration...
zh_cn: 加载 Ant 配置...

source: Loading Content
zh_cn: 加载内容中

source: Loading Content Revisions
zh_cn: 加载内容修订

source: Loading Contents
zh_cn: 加载内容

source: Loading File From Network
zh_cn: 从网络加载文件

source: Loading File History
zh_cn: 加载文件历史

source: Loading Project
zh_cn: 加载项目

source: Loading Project From Network
zh_cn: 从网络加载项目

source: Loading Revision {0}
zh_cn: 加载修订 {0}

source: Loading changelists...
zh_cn: 加载更改列表...

source: Loading classes...
zh_cn: 加载类...

source: Loading components for ''{0}''...
zh_cn: 为 ''{0}'' 加载组件...

source: Loading content for {0}
zh_cn: 加载内容为 {0}

source: Loading file history
zh_cn: 加载文件历史

source: Loading include indices...
zh_cn: 加载包含的索引...

source: Loading incoming changes
zh_cn: 加载传入的变化

source: Loading merge revisions...
zh_cn: 加载合并修订...

source: Loading revision {0}
zh_cn: 加载修订 {0}

source: Loading value
zh_cn: 加载值

source: Loading...
zh_cn: 载入中...

source: Loading…
zh_cn: 载入中…

source: Local
zh_cn: 本地

source: Local ({0})
zh_cn: 本地({0})

source: Local Changes
zh_cn: 本地更改

source: Local History
zh_cn: 本地历史

source: Local Scopes
zh_cn: 本地范围

source: Local Version
zh_cn: 本地版本

source: Local _History
zh_cn: 本地历史(_H)

source: Local class ''{0}'' is never used
zh_cn: 本地类 ''{0}'' 从未使用

source: Local variable ''{0}'' not found in class closure
zh_cn: 局部变量 ''{0}'' 在类闭包中没有找到

source: Local variable annotations
zh_cn: 局部变量注释

source: Local variable declaration
zh_cn: 局部变量声明

source: Local variable declarations are not supported here.
zh_cn: 这里不支持局部变量声明。

source: Local variable or parameter can be final
zh_cn: 局部变量或参数可以为 final

source: Local variable:
zh_cn: 局部变量:

source: Local variables
zh_cn: 局部变量

source: Local variables are not captured for synthetic, bridge etc. methods
zh_cn: 局部变量未被捕获用于合成，桥梁等方法

source: Local variables were not captured, you can change it in
zh_cn: 本地变量未被捕获，您可以更改它

source: Local version
zh_cn: 本地版本

source: Localize Plugin
zh_cn: 本地化插件

source: Locally Deleted Files
zh_cn: 本地删除的文件

source: Locally added
zh_cn: 本地添加的

source: Locally removed
zh_cn: 本地移除的

source: Locate caret inside a member
zh_cn: 定位插入符号到一个成员内部

source: Locating ''{0}''...
zh_cn: 定位 ''{0}''...

source: Location
zh_cn: 位置

source: Lock
zh_cn: 锁

source: Locked working copy folders
zh_cn: 锁定的工作副本文件夹

source: Log &message to console
zh_cn: 输出日志信息到控制台(&M)

source: Log Console//Error
zh_cn: 日志控制台//错误

source: Log Console//Expired entry
zh_cn: 日志控制台//过期条目

source: Log Console//Warning
zh_cn: 日志控制台//警告

source: Log File Entry
zh_cn: 日志文件条目

source: Log evaluated &expression
zh_cn: 日志计算表达式(&E)

source: Log expression
zh_cn: 日志表达式

source: Log expression:
zh_cn: 日志表达式:

source: Log files to be shown in console
zh_cn: 日志文件将显示在控制台

source: Log message
zh_cn: 日志消息

source: Log message: yes
zh_cn: 日志消息: 是

source: Log stack: yes
zh_cn: 日志堆栈: 是

source: Log to console:
zh_cn: 日志到控制台：

source: Log: {0}
zh_cn: 日志: {0}

source: Logging
zh_cn: 日志

source: Logging issues
zh_cn: 日 fnu 问题

source: Logical operators (\&\&, ||)
zh_cn: 逻辑运算符 (\&\&, ||)

source: Logs
zh_cn: 日志

source: Long number too large
zh_cn: long 数字太大

source: Look and Feel
zh_cn: 界面外观

source: Looking For Callers...
zh_cn: 寻找调用者...

source: Looking for TODOs...
zh_cn: 查找 TODO...

source: Looking for Usages
zh_cn: 查找使用中

source: Looking for sources to generate Javadoc
zh_cn: 寻找源以生成 Javadoc

source: Looking in available tag libraries
zh_cn: 查看可用的标签库

source: Looking in registered xml schemas
zh_cn: 查看注册的 xml 模式

source: Looking in {0}
zh_cn: 查找在 {0} 中

source: Lookup Down
zh_cn: 向下查找

source: Lookup List
zh_cn: 查阅列表

source: Lookup Up
zh_cn: 向上查找

source: Lookup height (items):
zh_cn: 查找高度(项):

source: Loop can be replaced with Arrays.setAll
zh_cn: 循环可以用 Arrays.setAll 替换

source: Lossy encoding
zh_cn: 有损编码

source: Low disk space on a {0} system directory partition
zh_cn: {0} 系统目录分区上的磁盘空间不足

source: M&ethod:
zh_cn: 方法:(&E)

source: MONITOR
zh_cn: 监视器

source: Macro Actions
zh_cn: 宏操作

source: Macro Name
zh_cn: 宏名称

source: Macro Name Already Used
zh_cn: 宏名已被使用

source: Macro attribute ''{0}'' is unknown
zh_cn: 宏属性 ''{0}'' 未知

source: Macro preview
zh_cn: 宏预览

source: Macrodef element
zh_cn: 宏定义元素

source: Macros
zh_cn: 宏

source: Main &class:
zh_cn: 主类:(&C)

source: Main Module
zh_cn: 主模块

source: Main Toolbar
zh_cn: 主工具栏

source: Main menu
zh_cn: 主菜单

source: Main method not found in class {0}
zh_cn: 主方法没有在类 {0} 中找到

source: Make
zh_cn: 编译

source: Make ''{0}'' a class
zh_cn: 使 ''{0}'' 成为类

source: Make ''{0}'' an interface
zh_cn: 使 ''{0}'' 成为接口

source: Make ''{0}'' extend ''{1}''
zh_cn: 使 ''{0}'' 继承 ''{1}''

source: Make ''{0}'' implement ''{1}''
zh_cn: 使 ''{0}'' 实现 ''{1}''

source: Make ''{0}'' not extend ''{1}''
zh_cn: 使 ''{0}'' 不继承 ''{1}''

source: Make ''{0}'' not implement ''{1}''
zh_cn: 使 ''{0}'' 不实现 ''{1}''

source: Make ''{0}'' not {1}
zh_cn: 使 ''{0}'' 不 {1}

source: Make ''{0}'' overridable
zh_cn: 使 ''{0}'' 可重写

source: Make ''{0}'' return ''{1}''
zh_cn: 使 ''{0}'' 返回 ''{1}''

source: Make ''{0}'' take parameter of type ''{1}'' here
zh_cn: 在此处输入 ''{1}'' 类型的参数 ''{0}''

source: Make ''{0}'' {1}
zh_cn: 使 ''{0}'' {1}

source: Make Class an Interface
zh_cn: 使类成为接口

source: Make De&fault
zh_cn: 使默认(&F)

source: Make Files/Directories {0,choice,0#Read-only|1#Writeable}
zh_cn: 使文件/目录{0,choice,0#只读|1#可写}

source: Make Final
zh_cn: 使 final

source: Make Method Static
zh_cn: 使方法静态化

source: Make S_tatic...
zh_cn: 静态化...(_T)

source: Make abstract
zh_cn: 使抽象化

source: Make build in &background
zh_cn: 使构建在后台(&B)

source: Make class &static
zh_cn: 使类 static(&S)

source: Make class ''{0}'' {1,choice,0#|1#and method {2} |1<and {1} required methods }extendable
zh_cn: 使 ''{0}'' {1,choice,0#|1#和方法 {2} |1<和 {1} 个所需方法 }可继承

source: Make final
zh_cn: 使用 final

source: Make generated local variables final
zh_cn: 使生成的局部变量 final

source: Make generated parameters final
zh_cn: 使生成的参数 final

source: Make method 'void'
zh_cn: 使方法为 'void'

source: Make method constructor
zh_cn: 制作方法构造函数

source: Make sure that the check box Copy rich text by default in the General page of the Editor settings/preferences is selected:
zh_cn: 确保选中编辑器的 settings/preferences 的常规页中的单选框 Copy rich text by default 。

source: Make sure to select the check box Simultaneous <tag></tag> editing in the Smart keys page of the Editor settings/preferences.
zh_cn: 确保在编辑器设置/偏好中的 Smart keys 页面，选中复选框 Simultaneous <tag></tag> editing 。

source: Make sure you have not selected any scriptlets, custom tags or other foreign languages elements.
zh_cn: 确保您没有选择任何 scriptlet，自定义标签或其他其他语言元素。

source: Make sure you installed {0} correctly.
zh_cn: 确保您正确安装了 {0}。

source: Make sure {1} is installed properly.</body></html>
zh_cn: 请确保 {1} 已正确安装。</body></html>

source: Make the editor tabs and lines in navigation lists stand out using the File Colors page of the project settings.
zh_cn: 使用项目设置的 File Colors 页面，可使导航列表中的编辑器选项卡和线条突出。

source: Make the editor tabs and the lines in navigation lists stand out using the File Colors page of the Appearance & Behavior settings.
zh_cn: 使用项目设置的 File Colors 页面，可使导航列表中的编辑器选项卡和线条突出。

source: Make vararg parameter last
zh_cn: 使可变参数在最后

source: Make your printouts (File | Print) nice and informative with the help of keywords.
zh_cn: 借助关键字，可以让输出 (File | Print) 更好，信息更全。

source: Make {0} Static
zh_cn: 使 {0} 静态化

source: Make {0} final
zh_cn: 使 {0} final

source: Make {0} {1} static
zh_cn: 使 {0}{1} 静态化

source: Make {2,choice,1#File|2#Files} {0,choice,0#Read-only|1#Writeable}
zh_cn: 使文件{0,choice,0#只读|1#可写}

source: Make {3,choice,1#Directory|2#Directories} {0,choice,0#Read-only|1#Writeable}
zh_cn: 使目录{0,choice,0#只读|1#可写}

source: Makes selected already unshelved changelist(s) available for unshelve again
zh_cn: 使选定的已取消搁置列表可再次用于搁置

source: Makes the method return or variable contain the opposite value and corrects the references
zh_cn: 使方法返回值或变量包含相反的值并更正引用

source: Making {0} static
zh_cn: 使 {0} 静态化

source: Malformed Resource Patterns
zh_cn: 异常资源模式

source: Malformed content of <script> tag
zh_cn: <script>标签格式错误的内容

source: Malformed floating point literal
zh_cn: 格式不正确的浮点文字

source: Malformed replacement pattern {0}
zh_cn: 格式错误的替换模式 {0}

source: Malformed url: {0}
zh_cn: 格式不正确的网址：{0}

source: Manage Projects...
zh_cn: 管理项目...

source: Manage colors
zh_cn: 管理颜色

source: Manage installed plugins and download new ones from repository
zh_cn: 管理已安装的插件，以及从仓库下载新的插件

source: Manual Order
zh_cn: 手动排序

source: Manual check of project file(s) with Rubocop using Code| Inspect Code or Code | Run Inspection by Name... (&shortcut:RunInspection;).
zh_cn: 使用 Code| Inspect Code 或 Code | Run Inspection by Name...（&shortcut:RunInspection;）用 Rubocop 手动检查项目文件。

source: Manual proxy configuration
zh_cn: 手动代理配置

source: Manually setup external resource
zh_cn: 手动设置外部资源

source: Map description:
zh_cn: 地图描述:

source: Map name:
zh_cn: 地图名字:

source: Margins (inches)
zh_cn: 边距(英寸)

source: Mark
zh_cn: 标记

source: Mark Directory as
zh_cn: 标记目录为

source: Mark File as
zh_cn: 标记文件为

source: Mark Illegal
zh_cn: 标记非法

source: Mark Object...
zh_cn: 标记对象...

source: Mark Source Directory
zh_cn: 标记源代码目录

source: Mark as Original File Type
zh_cn: 标记为原始文件类型

source: Mark as Plain Text
zh_cn: 标记为纯文本

source: Mark directory as a {0}
zh_cn: 将目录标记为 {0}

source: Mark modified tabs with asterisk
zh_cn: 用星号标记已修改的标签

source: Mark/unmark the object so that it can be visually distinguished in in debugger views
zh_cn: 标记/取消标记对象，以便它可以在调试器视图中直观的区分

source: Markers
zh_cn: 标记

source: Markup//Attribute
zh_cn: 标记//属性

source: Markup//Entity
zh_cn: 标记//实体

source: Markup//Tag
zh_cn: 标记//标签

source: Mask: {0}
zh_cn: 掩码: {0}

source: Match &case
zh_cn: 匹配(&C)

source: Matching rule have to be unique in the current settings.
zh_cn: 匹配规则在当前设置中必须是唯一的。

source: Matching rules
zh_cn: 匹配规则

source: Maven repository
zh_cn: Maven 仓库

source: Maximize Tool Window
zh_cn: 最大化工具窗口

source: Maximum &heap size (Mb):
zh_cn: 最大堆大小 (Mb):(&H)

source: Maximum &stack size (Mb):
zh_cn: 最大堆栈大小 (Mb):(&S)

source: Maximum count:
zh_cn: 最大数量：

source: Maximum heap size (MB):
zh_cn: 最大堆大小 (MB):

source: May we suggest some hints that will increase your productivity!
zh_cn: 我们可以给出一些提示，将提高您的生产力！

source: Me&thod
zh_cn: 方法(&T)

source: Mem&bers to be moved (static only)
zh_cn: 要移动的成员(仅限静态)(&B)

source: Mem&bers to be pulled up
zh_cn: 要上拉的成员(&B)

source: Mem&bers to be pushed down
zh_cn: 要下推的成员(&B)

source: Mem&bers to form interface
zh_cn: 从接口中成员到(&B)

source: Mem&bers to form superclass
zh_cn: 从超类的成员到(&B)

source: Member
zh_cn: 成员

source: Member is already static
zh_cn: 成员已经是静态的

source: Members to be moved
zh_cn: 要移动的成员

source: Members to be moved should belong to the same class
zh_cn: 要移动的成员应该属于同一个类

source: Memory
zh_cn: 内存

source: Memory Dump
zh_cn: 内存转储

source: Memory Management
zh_cn: 内存管理

source: Memory content
zh_cn: 内存内容

source: Memory issues
zh_cn: 内存问题

source: Menus and Toolbars
zh_cn: 菜单和工具栏

source: Menus and toolbars customization
zh_cn: 自定义菜单和工具栏

source: Merge
zh_cn: 合并

source: Merge ''{0}'' call and ''{1}'' call
zh_cn: 合并 ''{0}'' 调用和 ''{1}'' 调用

source: Merge Color Options
zh_cn: 合并颜色选项

source: Merge Result
zh_cn: 合并结果

source: Merge Revisions for {0}
zh_cn: 合并修订为 {0}

source: Merge else if statement
zh_cn: 合并 else if 语句

source: Merge filter chain
zh_cn: 合并过滤器链

source: Merge filter's chain
zh_cn: 合并过滤器链

source: Merge filters
zh_cn: 合并过滤器

source: Merge usages from the same line
zh_cn: 合并在同一行使用的

source: Merge with other ''{0} {1}'' directive
zh_cn: 与其他 ''{0} {1}'' 指令合并

source: Merge with other ''{0}'' directive
zh_cn: 与其他 ''{0}'' 指令合并

source: Merged
zh_cn: 合并的

source: Merged version
zh_cn: 合并版本

source: Merged with conflicts
zh_cn: 合并冲突

source: Merged with property conflicts
zh_cn: 合并属性冲突

source: Merged with text and property conflicts
zh_cn: 合并文本和属性冲突

source: Merged with tree conflicts
zh_cn: 已合并树冲突

source: Message
zh_cn: 消息

source: Metadata
zh_cn: 元数据

source: Method
zh_cn: 方法

source: Method ''{0}''
zh_cn: ''{0}'' 方法

source: Method ''{0}'' entered at {1}({2}:{3,number,#})
zh_cn: 放法 ''{0}'' 进入在 {1}({2}:{3,number,#})

source: Method ''{0}'' is about to exit at {1}({2}:{3,number,#})
zh_cn: 方法 ''{0}'' 将在 {1}({2}:{3,number,#}) 退出。

source: Method ''{0}'' is inherited.
zh_cn: 方法 ''{0}'' 被继承。

source: Method ''{0}'' is never used
zh_cn: 方法 ''{0}'' 从未使用

source: Method ''{0}'' is not declared in class ''{1}''
zh_cn: 方法 ''{0}'' 未在类 ''{1}'' 中声明

source: Method ''{0}'' is not public
zh_cn: 方法 ''{0}'' 不是公共的

source: Method ''{0}'' is not static
zh_cn: 方法 ''{0}'' 是非静态的

source: Method ''{0}'' is static
zh_cn: 方法 ''{0}'' 是静态的

source: Method ''{0}'' not found
zh_cn: 方法 ''{0}'' 未找到

source: Method ''{0}'' should be overridable
zh_cn: 方法 ''{0}'' 应可重写

source: Method <code>#ref</code> is too complex to analyze by data flow algorithm
zh_cn: 方法 <code>#ref</code> 太复杂，无法通过数据流算法进行分析

source: Method Is Inherited
zh_cn: 方法继承

source: Method Navigation Actions
zh_cn: 方法导航操作

source: Method Ob_ject...
zh_cn: 方法对象...(_J)

source: Method always returns {0}
zh_cn: 方法总是返回 {0}

source: Method and all its derivables always return {0}
zh_cn: 方法及其所有派生总是返回 {0}

source: Method annotated with @{0} must not override @{1} method
zh_cn: @{0} 注解的方法不能重写为 @{1}

source: Method annotations
zh_cn: 方法注释

source: Method bodies
zh_cn: 方法主体

source: Method breakpoint reached.
zh_cn: 方法断点到达。

source: Method breakpoints may dramatically slow down debugging
zh_cn: 方法断点可能会大大减慢调试速度

source: Method call arguments
zh_cn: 方法调用参数

source: Method call expected
zh_cn: 预期方法调用

source: Method call is nonstandard extension #loc
zh_cn: 方法调用是非标准扩展 #loc

source: Method call parentheses
zh_cn: 方法调用括号

source: Method calls:
zh_cn: 方法调用：

source: Method can be void
zh_cn: 方法可以返回 void

source: Method declaration parameters
zh_cn: 方法声明参数

source: Method declaration parentheses
zh_cn: 方法声明括号

source: Method does not override method from its superclass
zh_cn: 方法未覆盖其超类的方法

source: Method e&xit
zh_cn: 方法退出(&X)

source: Method entr&y
zh_cn: 方法进入(&Y)

source: Method has one usage but it is not reachable from entry points.
zh_cn: 方法有一个用法，但从入口点无法访问。

source: Method has usage(s) but they all belong to calls chain that has no members reachable from entry points.
zh_cn: 方法有使用，但它们全部属于没有入口点可访问的成员的调用链。

source: Method has {0, choice, 1#usage|2#{0,number} usages} but they are not reachable from entry points.
zh_cn: 方法有 {0, choice, 1# 1个使用|2#{0,number} 个使用}，但他们从入口点不可达。

source: Method implementation will be added to all directly implementing classes.
zh_cn: 方法实现将添加到所有直接实现类中。

source: Method invocation <code>#ref</code> #loc may produce <code>java.lang.NullPointerException</code>
zh_cn: 方法调用 <code>#ref</code> #loc 可能产生 <code>java.lang.NullPointerException</code>

source: Method is never used as a member of this {0}, but only as a member of the implementation class(es).
zh_cn: 方法从未用作此 {0} 的成员，但仅作为实现类的成员。

source: Method is never used.
zh_cn: 方法从未使用。

source: Method is not a constructor
zh_cn: 方法不是构造函数

source: Method is not reachable from entry points.
zh_cn: 方法从入口点是不可到达的。

source: Method is used in method reference.
zh_cn: 方法引用中的方法。

source: Method left brace
zh_cn: 方法左大括号

source: Method metrics
zh_cn: 方法指标

source: Method name not specified
zh_cn: 未指定方法名称

source: Method name:
zh_cn: 方法名称:

source: Method not found in class {0}
zh_cn: 类 {0} 中没有找到方法

source: Method only calls its super
zh_cn: 方法只调用它的超类

source: Method overrides a library method but<ul><li>its {0} is never instantiated OR</li><li>its {0} instantiation is not reachable from entry points.</li></ul>
zh_cn: 方法覆盖一个库方法但<ul><li>其 {0} 从未实例化，或</li><li>其 {0} 实例从入口点是不可到达的。</li></ul>

source: Method parameter declaration
zh_cn: 方法参数声明

source: Method parameters
zh_cn: 方法参数

source: Method parentheses
zh_cn: 方法括号

source: Method reference argument might be null
zh_cn: 方法引用参数可能为空

source: Method reference double colon
zh_cn: 方法参考双冒号

source: Method reference evaluation is not supported
zh_cn: 不支持方法引用解析

source: Method reference invocation <code>#ref</code> #loc may produce <code>java.lang.NullPointerException</code>
zh_cn: 方法引用调用 <code>#ref</code> #loc 可能产生 <code>java.lang.NullPointerException</code>

source: Method reference result is always ''{0}''
zh_cn: 方法引用结果总是 ''{0}''

source: Method references
zh_cn: 方法引用

source: Method return type
zh_cn: 方法返回类型

source: Method returns the same value
zh_cn: 方法返回相同的值

source: Method should be public or static
zh_cn: 方法应该是公共或静态的

source: Method signature will be changed to {0}
zh_cn: 方法签名将更改为 {0}

source: Method threw ''{0}'' exception.
zh_cn: 方法抛出 ''{0}'' 异常。

source: Method throws list
zh_cn: 方法的抛出列表

source: Method to Import
zh_cn: 要导入的方法

source: Method to Step Into
zh_cn: 步入的方法

source: Method to extract parameters from
zh_cn: 要提取参数的方法

source: Method to inline
zh_cn: 要内联的方法

source: Method to replace code duplicates
zh_cn: 方法来替换代码重复

source: Method whose parameters are to wrapped
zh_cn: 要包装其参数的方法

source: Method will not be pushed down to that class.
zh_cn: 方法不会被下推到那个类中。

source: Method will throw an exception when parameter is null
zh_cn: 当参数为 null 时，方法将抛出异常

source: Method {0}
zh_cn: 方法 {0}

source: Method {0} does not have a body
zh_cn: 方法 {0} 没有方法体

source: Method {0} has an empty body.
zh_cn: 方法 {0} 具有空方法体。

source: Method {0} is already defined in the {1}
zh_cn: 方法 {0} 已定义在 {1}

source: Method {0} is not static.
zh_cn: 方法 {0} 不是静态的。

source: Method {0} is overridden by {1}
zh_cn: 方法 {0} 被 {1} 重写。

source: Method {0} will hide the method of the base class {1}
zh_cn: 方法 {0} 将隐藏 基类 {1} 的方法

source: Method {0} will implement a method of the base class {1}
zh_cn: 方法 {0} 将实现 基类 {1} 的一个方法

source: Method {0} will override a method of the base class {1}
zh_cn: 方法 {0} 将覆盖 基类 {1} 的一个方法

source: Method {0} {1}
zh_cn: 方法 {0} {1}

source: Method {0} {1} method {2}.
zh_cn: 方法 {0} {1} 方法 {2}。

source: MethodHandle/VarHandle type mismatch
zh_cn: MethodHandle/VarHandle 类型不匹配

source: Methods ''boolean equals(Object)'' and ''int hashCode()'' are already defined for class {0}.
zh_cn: 方法 ''boolean equals(Object)'' 和 ''int hashCode()'' 已经在类 {0} 中定义了。

source: Methods 'boolean equals(Object)' and 'int hashCode()' are already defined for this anonymous class.
zh_cn: 方法 'boolean equals(Object)' 和 'int hashCode()' 已经在该匿名类中定义了。

source: Methods//Abstract method
zh_cn: 方法//抽象方法

source: Methods//Constructor call
zh_cn: 方法//构造函数调用
